##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.

print ("Введите два числа")
one = int(input('1 = '))
tow = int(input('2 = '))

print ('Сумма чисел = ',one+tow)
print ('Разность чисел = ',one-tow)
print ('Произведение чисел = ',one*tow)
print ('Частное чисел = ',one/tow)
print ('Целочисленное деление чисел = ',one//tow)
print ('Деление  чисел  с отстатком = ',one%tow)
print ('Возведение в степень = ',one**tow)

